Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2sme/facta/giellatekno/morfa.fin.html.tmx
Source language: fin
Languages: sme

source: Morfa-ohjelmien avulla pääsee systemaattisesti harjoittelemaan sanataivutusta, joko eriksesn (Morfa-S) tai lausekontekstssa, niin että myös oppii missä yhteydessä pitää käyttää kyseistä sanaa (Morfa-C).
sme: Dás beassá systemáhtalaččat hárjehallat sátnesojaheami - juogo eaŋkilsátnin (Morfa-S) dahje cealkagis nu ahte son maid oahppá makkár oktavuođas galgá geavahit sátnehámiid (Morfa-C).

source: Sanaluokka, lue enemmän alempana.
sme: Sátneluohkká, loga eanet vuolábealde.

source: Vartalotyyppi (Morfa-S): parillis-, pariton- tai supistumavartalo, tai kaikki kolme.
sme: Máddagat (Morfa-S): bárrastávval-, bárahisstávval- dahje kontrákta máddagat, dahje buot.

source: Tiettyjen oppikirjojen sanasto.
sme: Dihto oahppagirjji sátnevuorká.

source: Norjankielinen käännös, jos painaa tuntematonta sanaa.
sme: Oažžu dárogiel jorgalusa go deaddila sániid maid ii ipmir.

source: Apu: Jos antaa väärän vastauksen, niin ohjelma tarjoa apua oikean vastauksen muodustamiseen.
sme: Veahkki: Go čállá boastut, de fállojuvvo veahkki sojaheapmái.

source: Sanaluokat, joiden kanssa voi työskenellä, ovat substantiivit, adjektiivit, verbit, pronominit ja lukusanat.
sme: Sátneluohkát maiguin sáhttá bargat, leat substantiivvat, adjektiivvat, vearbbat, pronomenat ja logut.

source: Substantiivit: nominatiivin monikko ja kaikki sijamuodot, sanat annetaan joko yksikössä tai monikossa.
sme: Substantiivvat: nominatiiva máŋggaidlohku ja buot kásusat, vuođđosánit sáhttet leat sihke ovttaidlogus ja máŋggaidlogus.

source: Verbit: indikatiivin preesens ja preteriti, prefekti, konditionaali, potentiaali, imperatiivi ja gerundi.
sme: Vearbbat: indikatiiva preseansa ja preterihtta, prefeakta, konditionála, potentiála, imperatiiva ja gerunda.

source: Adjektiivit: attributin tai predikatiivin vertailumuodot.
sme: Adjektiivvat: attribuhttan dahje predikatiivan veardidemiin.

source: Morfa-S:ssa on samat mahdollisuudet, mutto myös eri sijamuodoissa.
sme: Morfa-S:s leat seammá, muhto máŋgga kásusis.

source: Pronominit: persoonapronominit, deiktiset pronominit, relatiivi-, refleksiivi- ja resiprookkipronominit, kaikissa sijamuodoissa.
sme: Pronomenat: persovnnalaš, čujuheaddji, relatiiva, refleksiiva ja resiproka, buot kasusiin.

source: Lukusanat kymmeneen asti monessa sijamuodossa, myös attribuuttina.
sme: Lohkosánit gitta 10 rádjai máŋgga kásusis, maid attribuhttan substantiivii.

source: Kollektiivilukujen ja järjestyslukujen sijataivutus.
sme: Čoahkkelogut ja ortnetlogut kásussojahemiin.

source: Morfa-S:n taso 1:ssä luvut ovat vain yksikössä.
sme: Morfa-S 1-dásis 1 leat logut dušše ovttaidlogus.

source: 2. taso sisältää myös lukusanojen monikkomuotoja.
sme: 2-dássi sisttisdoallá maid loguid máŋggaidlogus.

source: Morfa-C:ssa on lukusanojen taivutus sekä yksikössä ja monikossa kymmeneen asti.
sme: Morfa-C sisttisdoallá loguid sihke ovttaidlogus ja máŋggaidlogus gitta 10 rádjái.

source: Linkki: MORFA-S sanat
sme: Liŋka: MORFA-S sánit

source: Linkki: MORFA-C lauseet
sme: Liŋka: MORFA-C cealkagat
